---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireSizeSet.Size
source: html/24cc6a77-f4bb-3e62-23d5-80638ec374fb.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet.Size Property

Returns the number of wire sizes that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```